Repository: paulpetrut/sahajyog
Catalog: priv/gettext/*/LC_MESSAGES/default.po
Languages: ro

source: Actions
ro: Acțiuni

source: Attempting to reconnect
ro: Se încearcă reconectarea

source: Something went wrong!
ro: Ceva nu a mers bine!

source: We can't find the internet
ro: Nu putem găsi internetul

source: close
ro: închide

source: Browse All Talks
ro: Răsfoiește toate discursurile

source: Discover inner peace through meditation
ro: Descoperă pacea interioară prin meditație

source: Explore our complete collection of talks and guided meditations
ro: Explorează colecția noastră completă de discursuri și meditații ghidate

source: Hide sidebar
ro: Ascunde bara laterală

source: Mark as Watched
ro: Marchează ca vizionat

source: Ready to Begin Your Journey?
ro: Gata să începi călătoria ta?

source: Reset all progress
ro: Resetează tot progresul

source: SahajYog Content
ro: Conținut SahajYog

source: Show sidebar
ro: Arată bara laterală

source: Start Learning
ro: Începe să înveți

source: Welcome to Sahaja Yoga
ro: Bine ai venit la Sahaja Yoga

source: Advanced Topics
ro: Subiecte avansate

source: Excerpts
ro: Extrase

source: Getting Started
ro: Primii pași

source: Active filters:
ro: Filtre active:

source: Advanced Filters
ro: Filtre Avansate

source: All Categories
ro: Toate categoriile

source: All Countries
ro: Toate țările

source: All Languages
ro: Toate limbile

source: All Years
ro: Toți anii

source: Category
ro: Categorie

source: Clear all
ro: Șterge toate

source: Country
ro: Țară

source: Error Loading Talks
ro: Eroare la încărcarea discursurilor

source: Explore spiritual teachings and wisdom
ro: Explorează învățături spirituale și înțelepciune

source: Hide
ro: Ascunde

source: Loading talks...
ro: Se încarcă discursurile...

source: Newest
ro: Cele mai noi

source: Next
ro: Următorul

source: No talks available
ro: Nu sunt discursuri disponibile

source: Oldest
ro: Cele mai vechi

source: Previous
ro: Anterior

source: Relevance
ro: Relevanță

source: Sahaja Yoga Talks
ro: Discursuri Sahaja Yoga

source: Search
ro: Căutare

source: Search talks...
ro: Caută discursuri...

source: Show
ro: Arată

source: Showing
ro: Se afișează

source: Sort By
ro: Sortează după

source: Spoken Language
ro: Limba vorbită

source: Year
ro: An

source: of
ro: din

source: talk
ro: discurs

source: to
ro: la

source: No videos available
ro: Nu sunt videoclipuri disponibile

source: Please add videos to get started
ro: Te rugăm să adaugi videoclipuri pentru a începe

source: Dev mode:
ro: Mod dezvoltare:

source: Don't have an account?
ro: Nu ai un cont?

source: Enter your password
ro: Introdu parola

source: Keep me signed in
ro: Ține-mă autentificat

source: Password
ro: Parolă

source: Please reauthenticate to continue
ro: Te rugăm să te autentifici din nou pentru a continua

source: Send magic link
ro: Trimite link magic

source: Sign in
ro: Autentificare

source: Sign in to your account to continue
ro: Autentifică-te în contul tău pentru a continua

source: Sign up
ro: Înregistrează-te

source: View mailbox
ro: Vezi căsuța poștală

source: We'll email you a secure link to sign in without a password.
ro: Îți vom trimite un link securizat prin email pentru a te autentifica fără parolă.

source: you@example.com
ro: tu@exemplu.com

source: Already registered?
ro: Deja înregistrat?

source: An email was sent to %{email}, please access it to confirm your account.
ro: Un email a fost trimis la %{email}, te rugăm să îl accesezi pentru a confirma contul.

source: Create an account
ro: Creează un cont

source: Creating account...
ro: Se creează contul...

source: Log in
ro: Autentificare

source: Register for an account
ro: Înregistrează-te pentru un cont

source: to your account now.
ro: în contul tău acum.

source: Confirm password (optional)
ro: Confirmă parola (opțional)

source: Leave blank to use magic link login
ro: Lasă gol pentru a folosi autentificarea cu link magic

source: Only if you set a password above
ro: Doar dacă ai setat o parolă mai sus

source: Register
ro: Înregistrează-te

source: Account created but we couldn't send the confirmation email. Please contact support.
ro: Contul a fost creat dar nu am putut trimite emailul de confirmare. Te rugăm să contactezi suportul.

source: Check your email! If your address is in our system, you'll receive a sign-in link shortly.
ro: Verifică-ți emailul! Dacă adresa ta este în sistemul nostru, vei primi în curând un link de autentificare.

source: A link to confirm your email change has been sent to the new address.
ro: Un link pentru confirmarea schimbării emailului a fost trimis la noua adresă.

source: Account Settings
ro: Setări cont

source: Change Email
ro: Schimbă emailul

source: Changing...
ro: Se schimbă...

source: Confirm new password
ro: Confirmă parola nouă

source: Email change link is invalid or it has expired.
ro: Link-ul de schimbare email este invalid sau a expirat.

source: Email changed successfully.
ro: Email schimbat cu succes.

source: Manage your account email address and password settings
ro: Gestionează adresa de email și setările parolei contului tău

source: New password
ro: Parolă nouă

source: Save Password
ro: Salvează parola

source: Saving...
ro: Se salvează...

source: Invalid email or password
ro: Email sau parolă invalidă

source: Logged out successfully.
ro: Deconectat cu succes.

source: Password updated successfully!
ro: Parolă actualizată cu succes!

source: The link is invalid or it has expired.
ro: Link-ul este invalid sau a expirat.

source: User confirmed successfully.
ro: Utilizator confirmat cu succes.

source: Welcome back!
ro: Bine ai revenit!

source: Your account has been confirmed! Please log in with your password.
ro: Contul tău a fost confirmat! Te rugăm să te autentifici cu parola ta.

source: Are you sure?
ro: Ești sigur?

source: Back to Resources
ro: Înapoi la Resurse

source: Cancel
ro: Anulează

source: Click to upload or drag and drop
ro: Faceți clic pentru a încărca sau trageți și plasați

source: Delete
ro: Șterge

source: Description
ro: Descriere

source: Download
ro: Descarcă

source: Downloads
ro: Descărcări

source: Edit
ro: Editează

source: Edit Resource
ro: Editează Resursa

source: File
ro: Fișier

source: Level
ro: Nivel

source: Max 500MB
ro: Maxim 500 MB

source: No resources available for your level
ro: Nu există resurse disponibile pentru nivelul tău

source: Resources
ro: Resurse

source: Select a level
ro: Selectează un nivel

source: Select a type
ro: Selectează un tip

source: Size
ro: Dimensiune

source: Title
ro: Titlu

source: Type
ro: Tip

source: Update Resource
ro: Actualizează Resursa

source: Upload Resource
ro: Încarcă Resursă

source: Videos
ro: Videoclipuri

source: Change Password
ro: Schimbă Parola

source: English (Default)
ro: Engleză (Implicit)

source: Sign out
ro: Deconectare

source: Translation Language
ro: Limba de Traducere

source: Add Reference
ro: Adaugă Referință

source: Back to Topic
ro: Înapoi la Subiect

source: Back to Topics
ro: Înapoi la Subiecte

source: Be the first to propose a topic
ro: Fii primul care propune un subiect

source: Briefly describe what this topic should cover...
ro: Descrie pe scurt ce ar trebui să acopere acest subiect...

source: Co-authors
ro: Co-autori

source: Content
ro: Conținut

source: Edit Reference
ro: Editează Referință

source: Edit Topic
ro: Editează Subiect

source: Explore Topics
ro: Explorează Subiecte

source: Explore in-depth articles on Sahaja Yoga
ro: Explorează articole detaliate despre Sahaja Yoga

source: New Reference
ro: Referință Nouă

source: No content yet
ro: Încă nu există conținut

source: No topics yet
ro: Încă nu există subiecte

source: Propose Topic
ro: Propune Subiect

source: Propose a New Topic
ro: Propune un Subiect Nou

source: Quick Add from Resources
ro: Adaugă Rapid din Resurse

source: Reference deleted
ro: Referința a fost ștearsă

source: Reference saved
ro: Referința a fost salvată

source: References
ro: Referințe

source: Resource details loaded. Review and save.
ro: Detaliile resursei au fost încărcate. Revizuiește și salvează.

source: Save
ro: Salvează

source: Save Changes
ro: Salvează Modificările

source: Select a resource to auto-fill the reference details
ro: Selectează o resursă pentru a completa automat detaliile referinței

source: Select a resource...
ro: Selectează o resursă...

source: Submit Proposal
ro: Trimite Propunerea

source: Suggest a topic for the community. An admin will review and approve it.
ro: Sugerează un subiect pentru comunitate. Un administrator îl va revizui și aproba.

source: Topic Title
ro: Titlul Subiectului

source: Topic proposal submitted successfully
ro: Propunerea de subiect a fost trimisă cu succes

source: Topic updated successfully
ro: Subiectul a fost actualizat cu succes

source: Topics
ro: Subiecte

source: Watch Talk
ro: Vizionează Discursul

source: Write your topic content here...
ro: Scrie conținutul subiectului aici...

source: You don't have permission to edit this topic
ro: Nu ai permisiunea de a edita acest subiect

source: e.g., Understanding the Chakras
ro: de ex., Înțelegerea Chakrelor

source: views
ro: vizualizări

source: Talks
ro: Discursuri

source: Steps
ro: Pași

source: Confirm Account
ro: Confirmă Contul

source: Confirm and log in only this time
ro: Confirmă și autentifică-te doar de data aceasta

source: Confirm and stay logged in
ro: Confirmă și rămâi autentificat

source: Confirming...
ro: Se confirmă...

source: Keep me logged in on this device
ro: Ține-mă autentificat pe acest dispozitiv

source: Log me in only this time
ro: Autentifică-mă doar de data aceasta

source: Logging in...
ro: Se autentifică...

source: Magic link is invalid or it has expired.
ro: Link-ul magic este invalid sau a expirat.

source: Tip: If you prefer passwords, you can enable them in the user settings.
ro: Sfat: Dacă preferi parole, le poți activa în setările contului.

source: Welcome %{email}
ro: Bine ai venit %{email}

source: Tip Images: click to resize • use ◀ ▶ to wrap text around
ro: Sfat Imagini: click pentru redimensionare • folosește ◀ ▶ pentru text în jurul imaginii

source: Contact Us
ro: Contactați-ne

source: Have a question or feedback? We'd love to hear from you.
ro: Aveți o întrebare sau un feedback? Ne-ar plăcea să auzim de la dumneavoastră.

source: Thank you for reaching out!
ro: Vă mulțumim că ne-ați contactat!

source: We've received your message and will respond as soon as possible.
ro: Am primit mesajul dumneavoastră și vom răspunde cât mai curând posibil.

source: Back to Home
ro: Înapoi la pagina principală

source: Your name
ro: Numele dumneavoastră

source: your.email@example.com
ro: email.dvs@exemplu.ro

source: What is this about?
ro: Despre ce este vorba?

source: Tell us more...
ro: Spuneți-ne mai multe...

source: Send Message
ro: Trimite mesajul

source: Message sent successfully! We'll get back to you soon.
ro: Mesaj trimis cu succes! Vă vom răspunde în curând.

source: Failed to send message. Please try again or email us directly.
ro: Trimiterea mesajului a eșuat. Vă rugăm să încercați din nou sau să ne trimiteți un email direct.

source: Name is required
ro: Numele este obligatoriu

source: Email is required
ro: Email-ul este obligatoriu

source: Email is invalid
ro: Email-ul nu este valid

source: Subject is required
ro: Subiectul este obligatoriu

source: Message is required
ro: Mesajul este obligatoriu

source: Quick Links
ro: Link-uri rapide

source: About
ro: Despre

source: Discover inner peace through Sahaja Yoga meditation. Explore teachings, talks, and resources for your spiritual journey.
ro: Descoperă pacea interioară prin meditația Sahaja Yoga. Explorează învățături, discursuri și resurse pentru călătoria ta spirituală.

source: Get in Touch
ro: Luați legătura

source: All rights reserved.
ro: Toate drepturile rezervate.

source: Name
ro: Nume

source: Subject
ro: Subiect

source: Message
ro: Mesaj
