Repository: paulpetrut/sahajyog
Catalog: priv/gettext/*/LC_MESSAGES/errors.po
Languages: ro

source: can't be blank
ro: nu poate fi gol

source: has already been taken
ro: este deja folosit

source: is invalid
ro: este invalid

source: must be accepted
ro: trebuie acceptat

source: has invalid format
ro: are format invalid

source: has an invalid entry
ro: are o intrare invalidă

source: is reserved
ro: este rezervat

source: does not match confirmation
ro: nu se potrivește

source: is still associated with this entry
ro: este încă asociat cu această intrare

source: are still associated with this entry
ro: sunt încă asociate cu această intrare

source: should have %{count} item(s)
ro: ar trebui să aibă %{count} element

source: should be %{count} character(s)
ro: ar trebui să fie %{count} caracter

source: should be at least %{count} character(s)
ro: ar trebui să fie cel puțin %{count} caracter

source: must be less than %{number}
ro: trebuie să fie mai mic decât %{number}

source: must be greater than %{number}
ro: trebuie să fie mai mare decât %{number}

source: must be less than or equal to %{number}
ro: trebuie să fie mai mic sau egal cu %{number}

source: must be greater than or equal to %{number}
ro: trebuie să fie mai mare sau egal cu %{number}

source: must be equal to %{number}
ro: trebuie să fie egal cu %{number}
